project/app/views/orders/new.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 6], ["id", 10]]
---
        <span>总计</span>
        <span class="total-amount">￥<%= @cart_items.sum { |item| item.product.price * item.quantity } %></span>

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 3]]
---
          <%= f.label :user_address_id, "选择收货地址" %>
          <%= f.select :user_address_id,
              options_for_select(@user_addresses.map { |a| ["#{a.name} (#{a.phone_num}) - #{a.address}", a.id] },
              selected: @selected_address_id),
              { prompt: "请选择地址" },
              { class: "address-select" } %>