project/app/controllers/addresses_controller.rb

    def create
      @address = current_user.addresses.new(address_params)
      if @address.save
---
INSERT INTO "addresses" ("user_id", "name", "phone_num", "address", "default", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["name", "郭永康"], ["phone_num", "15315285588"], ["address", "大苏打实打实的"], ["default", 1], ["created_at", "2024-11-25 13:10:00.657845"], ["updated_at", "2024-11-25 13:10:00.657845"]]

    def edit
      @address = current_user.addresses.find(params[:id])
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

    def update
      @address = current_user.addresses.find(params[:id])
      if @address.update(address_params)
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 3], ["id", 4], ["LIMIT", 1]]
UPDATE "addresses" SET "default" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["default", 1], ["updated_at", "2024-11-26 13:04:34.652495"], ["id", 4]]

    def destroy
      @address = current_user.addresses.find(params[:id])
      @address.destroy
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 6], ["id", 6], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 6]]