project/app/controllers/application_controller.rb

  def current_cart
    @current_cart ||= Cart.find_or_create_by(id: session[:cart_id]) do |cart|
---
INSERT INTO "carts" ("id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["id", 8], ["user_id", 3], ["created_at", "2024-11-26 03:48:55.637454"], ["updated_at", "2024-11-26 03:48:55.637454"]]

  def set_cart
    if user_signed_in?
      @cart = current_user.cart || current_user.create_cart
    else
      @cart = Cart.find_by(id: session[:cart_id]) || Cart.create
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["user_id", 3], ["created_at", "2024-11-26 03:48:52.717560"], ["updated_at", "2024-11-26 03:48:52.717560"]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]