project/app/controllers/cart_items_controller.rb

    def create
      product = Product.find(params[:product_id])
      @cart = current_user.cart || current_user.create_cart
      cart_item = @cart.cart_items.find_or_initialize_by(product: product)
      if cart_item.new_record?
        cart_item.quantity = params[:quantity] || 1
      else
        cart_item.quantity += 1
      end
      if cart_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 8], ["product_id", 7], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 6], ["updated_at", "2024-11-26 05:14:09.556119"], ["id", 14]]

    def update_quantity
      @cart_item = CartItem.find(params[:id])
      new_quantity = params[:cart_item][:quantity].to_i
      if new_quantity >= 0
        if new_quantity == 0
          @cart_item.destroy
          redirect_to cart_path, notice: '商品已从购物车移除！'
        else
          @cart_item.update(quantity: new_quantity)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 15]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2024-11-26 05:08:13.196257"], ["id", 14]]