project/app/controllers/carts_controller.rb

  def checkout
    @cart = current_user.cart
    @order = Order.new(user: current_user, status: :pending, total_price: @cart.total_price)
    @cart.cart_items.each do |cart_item|
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]