project/app/controllers/favorites_controller.rb

  def index
    @favorites = current_user.favorites.includes(:product)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 3]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 6], ["id", 7]]

  def create
    @product = Product.find(params[:product_id])
    current_user.favorite_products << @product
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["product_id", 6], ["created_at", "2024-11-27 08:43:57.795870"], ["updated_at", "2024-11-27 08:43:57.795870"]]

  def destroy
    favorite = current_user.favorites.find_by(params[:id])
    favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND (1) LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]