project/app/controllers/orders_controller.rb

  def index
    if current_user.is_admin?
      @orders = Order.all
    else
      @orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT ?  [["user_id", 3], ["id", 7], ["LIMIT", 1]]

  def show
    if current_user.is_admin?
      @order = Order.all.find_by(id: params[:id])
    else
      @order = current_user.orders.find_by(id: params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT ?  [["user_id", 3], ["id", 7], ["LIMIT", 1]]

  def new
    @order = current_user.orders.new
    @cart_items = current_user.cart.cart_items.includes(:product)
    @user_addresses = current_user.addresses
    @selected_address_id = params[:user_address_id] || @user_addresses.find_by(default: true)&.id
    @selected_address = @user_addresses.find_by(id: @selected_address_id)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 6], ["id", 10]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 8]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 3], ["id", 3], ["LIMIT", 1]]

  def create
    @order = current_user.orders.new(order_params)
    @order.address_id = params[:order][:user_address_id]
    @order.address = current_user.addresses.find_by(id: @order.address_id)
    @order.status = params[:order][:status] || "待支付"
    @order.total_price = current_user.cart.total_price

    @cart_items = current_user.cart.cart_items.includes(:product)

    inventory_error = nil
    @cart_items.each do |cart_item|
      if cart_item.product.stock < cart_item.quantity
        inventory_error = "商品 #{cart_item.product.name} 的库存不足，仅剩 #{cart_item.product.stock} 件。"
        break
      end
    end

    if inventory_error
      flash[:error] = inventory_error
      @user_addresses = current_user.addresses
      render :new, status: :unprocessable_entity and return
    end

    # 保存订单及其明细
    if @order.save
      @cart_items.each do |cart_item|
        @order.order_items.create!(
          product: cart_item.product,
          quantity: cart_item.quantity,
          price: cart_item.product.price
        )
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 8]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "total_price", "status", "created_at", "updated_at", "user_address_id", "address_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["total_price", 106.99], ["status", "0"], ["created_at", "2024-11-27 03:25:29.582595"], ["updated_at", "2024-11-27 03:25:29.582595"], ["user_address_id", 3], ["address_id", 3]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "decimal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 1], ["product_id", 6], ["quantity", 7], ["price", "1.0"], ["decimal", nil], ["created_at", "2024-11-27 03:25:29.630667"], ["updated_at", "2024-11-27 03:25:29.630667"]]

          )
        end
      end
      current_user.cart.cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 14]]