project/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "description", "stock", "sales", "image_url", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "test"], ["description", "测试"], ["stock", 5], ["sales", 1], ["image_url", nil], ["created_at", "2024-11-25 09:18:08.447734"], ["updated_at", "2024-11-25 09:18:08.447734"], ["price", nil]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2024-11-25 08:54:27.096801"], ["id", 1]]

  def up
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]