project/app/models/address.rb

UPDATE "addresses" SET "default" = ? WHERE "addresses"."id" != ?  [["default", 0], ["id", 1]]
---
  def set_default_address
    # 将所有其他地址的默认地址标记为 false
    Address.where.not(id: self.id).update_all(default: false)