blog4/app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["title", "今天吃什么"], ["content", "今天吃食堂"], ["created_at", "2024-10-25 06:28:37.012387"], ["updated_at", "2024-10-25 06:28:37.012387"]]
---
  def create
    @blog = current_user.blogs.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "这是一个重新测试"], ["content", "编辑测试"], ["updated_at", "2024-10-26 10:30:39.621598"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params.merge(user_id: current_user.id))

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 5]]
---
  def destroy
    @blog.destroy!

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.find(params[:id])