blog4/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = Comment.all

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("blog_id", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["blog_id", 1], ["content", "111"], ["user_id", 3], ["created_at", "2024-10-26 08:14:23.673329"], ["updated_at", "2024-10-26 08:14:23.673329"]]
---
  def create
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.new(comment_params.merge(user_id: current_user.id))
    @comment.blog = @blog

    respond_to do |format|
      if @comment.save