blog4/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "gyk"], ["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2024-10-25 03:17:45.664257"], ["updated_at", "2024-10-25 03:17:45.664257"]]
---
  def create
    @user = User.new(user_params)
    if @user.save