project/app/views/products/index.html.erb

                <% end %>
                <% if current_user.favorites.exists?(product_id: product.id) %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."product_id" = ? LIMIT ?  [["user_id", 3], ["product_id", 10], ["LIMIT", 1]]
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."product_id" = ? LIMIT ?  [["user_id", 3], ["product_id", 6], ["LIMIT", 1]]